notes/oct2/oct2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-04 Wed 00:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Structural rules</title>
<meta name="author" content="Julian Grove" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Structural rules</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org531745f">1. Review</a>
<ul>
<li><a href="#orgacea9c1">1.1. Exchange</a></li>
<li><a href="#orgd8b420b">1.2. Contraction</a></li>
<li><a href="#org260ed3f">1.3. Weakening</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org531745f" class="outline-2">
<h2 id="org531745f"><span class="section-number-2">1.</span> Review</h2>
<div class="outline-text-2" id="text-1">
<p>
In our presentation of propositional logic and typed λ-calculus, we have
implicitly baked certain <i>structural rules</i> into our proof system. Such
structural rules pertain to the structure of our judgments; i.e., objects of
the form \(Γ ⊢ φ\).
</p>
</div>

<div id="outline-container-orgacea9c1" class="outline-3">
<h3 id="orgacea9c1"><span class="section-number-3">1.1.</span> Exchange</h3>
<div class="outline-text-3" id="text-1-1">
<p>
To start, we have been assuming our contexts to be <i>sets</i> of named formulae
(or, equivalently, partial functions from a set of names to the set of
formulae). By regarding contexts as such sets, we have implicitly assumed
that the <i>order</i> in which assumptions are listed makes no difference. Thus the
context \(x : p, y : q\) (for example) is the same as the context \(y : q, x :
   p\). If we instead view contexts as <i>sequences</i> of named formulae, we may encode
that assumptions are commutative as a structural rule, called `exchange'.
\[\frac{Γ, x : φ, y : ψ, Δ ⊢ χ}{Γ, y : ψ, x : φ, Δ ⊢ χ}\mathtt{Exch.}\]
</p>
</div>
</div>

<div id="outline-container-orgd8b420b" class="outline-3">
<h3 id="orgd8b420b"><span class="section-number-3">1.2.</span> Contraction</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Additionally, viewing contexts as sets carries the commitment that a given
assumption is either present or absent in a context, but that it may not, for
example, occur multiple distinct times. Thus the context \(x : p, x : p, y: q\)
is the same as the context \(x : p, y : q\), where the assumption \(x : p\) is
written only once. Moreover, when we join two contexts \(Γ\) and \(Δ\) together,
we simply take their union \(Γ ∪ Δ\), and we allow that a given assumption may
have occurred in both \(Γ\) and \(Δ\). Again viewing contexts as sequences,
rather than sets, these two facts may be encoded as a structural rule,
<i>contraction</i>, that allows two occurrences of an assumption to be contracted
into only one occurrence.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
\[\frac{Γ, x : φ, y : φ, Δ ⊢ ψ}{Γ, z : φ, Δ ⊢ ψ}\mathtt{Contr.}\]
</p>

<p>
If one were to get rid of the rule of contraction, one would obtain a logic
of resources: it would matter, not just whether or not an assumption is used
in some proof, but <i>how many times</i> it is used.
</p>
</div>
</div>

<div id="outline-container-org260ed3f" class="outline-3">
<h3 id="org260ed3f"><span class="section-number-3">1.3.</span> Weakening</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Finally, we have been assuming a formulation of the \(\mathtt{Ax}\) rule that
allows us to introduce assumptions which are never used. That is, our current
rule is formulated as
\[\frac{}{Γ, x : φ ⊢ φ}\mathtt{Ax}\]
where \(Γ\) may contain any number of assumptions in it. By doing so, we have
implicitly assumed a structural rule, <i>weakening</i>, which allows a given context
to spontaneously introduce new assumptions, though they may never be
used.<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
\[\frac{Γ, Δ ⊢ ψ}{Γ, z : φ, Δ ⊢ ψ}\mathtt{Weak.}\]  
We may therefore reformulate our axiom rule as
\[\frac{}{x : φ ⊢ φ}\mathtt{Ax}\]
and use weakening to recapture the rule as originally formulated.
</p>

<p>
Logics that don't assume weakening are called `relevant' logics&#x2014;they ensure
that assumptions which are introduced in a proof are, in fact, relevant to
that proof, i.e., by being used in it in some way.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">As a matter of convention, we can pick a \(z\)
which is fresh for both \(Γ\) and \(Δ\); doing so ensures, for example, that
names are associated with formulae uniquely.</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">We may again adopt the convention of assuming that \(z\) is fresh for
\(Γ\) and \(Δ\).</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Julian Grove</p>
<p class="date">Created: 2023-10-04 Wed 00:11</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>